Revit 2027 API
CurveArrArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual CurveArrArrayIterator ForwardIterator()
Public Overridable Function ForwardIterator As CurveArrArrayIterator
public:
virtual CurveArrArrayIterator^ ForwardIterator()
abstract ForwardIterator : unit -> CurveArrArrayIterator
override ForwardIterator : unit -> CurveArrArrayIterator
Return Value
CurveArrArrayIterator
Returns a forward moving iterator to the array.
See Also
Reference
CurveArrArray Class
Autodesk.Revit.DB Namespace